#+TITLE: Doom Config
*** F-Sharp Config
#+begin_src emacs-lisp :tangle yes

(with-eval-after-load 'fsharp-mode
  (add-hook 'fsharp-mode-hook #'origami-mode))

(add-to-list 'evil-fold-list
             '((fsharp-mode)
               :close (lambda ()
                        (origami-close-node (current-buffer) (point)))
               :open (lambda ()
                       (origami-open-node (current-buffer) (point)))
               :toggle (lambda ()
                         (origami-toggle-node (current-buffer) (point)))))

;; (defun cfg-outline-indent-level ()
;;   "determine outline level based on indentation"
;;   (let (buffer-invisibility-spec)
;;     (save-excursion
;;       (beginning-of-line)
;;       (skip-chars-forward " ")
;;       (+ 1 (current-column)))))

;; (defun cfg-fsharp-enable-folding ()
;;   "enables folding for fsharp"
;;   (setq-local outline-regexp "^ *\\(\\w\\|/\\)")
;;   (setq-local outline-level #'cfg-outline-indent-level)
;;   (outline-minor-mode 1))

;; (defun cfg-fsharp ()
;;   "Configure fsharp environment"
;;   (with-eval-after-load 'fsharp-mode
;;     (add-hook 'fsharp-mode-hook #'cfg-fsharp-enable-folding)))

;; (defun cfg-outline ()
;;   "Optional - Configure evil-fold for outline-minor-mode"
;;   (add-to-list 'evil-fold-list '((outline-minor-mode)
;;                                  :open-all   outline-show-all
;;                                  :close-all  (lambda () (call-interactively 'outline-hide-sublevels))
;;                                  :toggle     outline-toggle-children
;;                                  :open       outline-show-children
;;                                  :open-rec   nil
;;                                  :close      outline-hide-subtree)))

;; (cfg-fsharp)
;; (cfg-outline)
#+end_src

#+RESULTS:
| (fsharp-mode)                                            | :close    | (lambda nil (origami-close-node (current-buffer) (point))) | :open      | (lambda nil (origami-open-node (current-buffer) (point))) | :toggle | (lambda nil (origami-toggle-node (current-buffer) (point))) |       |                                                           |           |                                                           |        |                                                            |
| (vdiff-mode)                                             | :open-all | vdiff-open-all-folds                                       | :close-all | vdiff-close-all-folds                                     | :toggle | #[0 \300\301!\207 [call-interactively vdiff-toggle-fold] 2] | :open | #[0 \300\301!\207 [call-interactively vdiff-open-fold] 2] | :open-rec | #[0 \300\301!\207 [call-interactively vdiff-open-fold] 2] | :close | #[0 \300\301!\207 [call-interactively vdiff-close-fold] 2] |
| (vdiff-3way-mode)                                        | :open-all | vdiff-open-all-folds                                       | :close-all | vdiff-close-all-folds                                     | :toggle | #[0 \300\301!\207 [call-interactively vdiff-toggle-fold] 2] | :open | #[0 \300\301!\207 [call-interactively vdiff-open-fold] 2] | :open-rec | #[0 \300\301!\207 [call-interactively vdiff-open-fold] 2] | :close | #[0 \300\301!\207 [call-interactively vdiff-close-fold] 2] |
| (hs-minor-mode)                                          | :open-all | hs-show-all                                                | :close-all | hs-hide-all                                               | :toggle | hs-toggle-hiding                                            | :open | hs-show-block                                             | :open-rec | nil                                                       | :close | hs-hide-block                                              |
| (hide-ifdef-mode)                                        | :open-all | show-ifdefs                                                | :close-all | hide-ifdefs                                               | :toggle | nil                                                         | :open | show-ifdef-block                                          | :open-rec | nil                                                       | :close | hide-ifdef-block                                           |
| (outline-mode outline-minor-mode org-mode markdown-mode) | :open-all | show-all                                                   | :close-all | #[0 \300\301!\207 [hide-sublevels 1] 2]                   | :toggle | outline-toggle-children                                     | :open | #[0 \300 \210\301 \207 [show-entry show-children] 1]      | :open-rec | show-subtree                                              | :close | hide-subtree                                               |
| (origami-mode)                                           | :open-all | #[0 \300p!\207 [origami-open-all-nodes] 2]                 | :close-all | #[0 \300p!\207 [origami-close-all-nodes] 2]               | :toggle | #[0 \300p`"\207 [origami-toggle-node] 3]                    | :open | #[0 \300p`"\207 [origami-open-node] 3]                    | :open-rec | #[0 \300p`"\207 [origami-open-node-recursively] 3]        | :close | #[0 \300p`"\207 [origami-close-node] 3]                    |
*** Setup Funcs

#+begin_src emacs-lisp :tangle yes
(require 'org-id)
(require 'org-expiry)

(defun set-org-dir ()
  (require 'org)
  (setq org-directory (if (eq system-type 'darwin)
                        "~/Docs/org"
                        "~/org")))

(set-org-dir)

(defun dfs-insert-created-timestamp (_)
  "Insert a 'Created' property for every todo that is created"
  (org-expiry-insert-created)
  (org-back-to-heading)
  (org-end-of-line)
  (evil-insert 1))

(defun dfs/insert-id (_)
  "Insert an 'ID' property for every todo that is created"
  (org-id-get-create)
  (org-back-to-heading)
  (org-end-of-line)
  (evil-insert 1))

(setq dfs/org-protocol-capture-templates
      '(("e" "Email Capture" entry (id "89f73e32-77ec-4052-94aa-22753c0c5a27")
         "** EMAIL %(plist-get dfs/org-protocol-query :title) harharhar %(plist-get dfs/org-protocol-query :sched) %U"
         :immediate-finish t)))

(setq org-browser-capture-file (if (eq system-type 'darwin)
                           "~/Docs/org/browser-capture.org"
                           "~/org/browser-capture.org"))

(setq dfs/org-capture-templates
      '(("c" "Cookbook")
        ("cc" "Cookbook (from url)" entry (file "cookbook.org")
         "%(org-chef-get-recipe-from-url)"
         :empty-lines 1)
        ("w" "Chuck Walk" table-line
         (id  "b42729b6-1cc1-460c-a7b5-6b0eb8a3970f")
         "| %u | %^{Time|morning|afternoon|evening} | %^{Slowdown} | %^{Notes} |")
        ("j" "Journal Entry" entry
         (file+olp+datetree "journal.org" )
         "* %?"
         :time-prompt t)
        ("r" "Reviews")
        ("rg" "Generic Review" entry (file+olp+datetree "journal.org")
         "* %^{Title} %^g\n%^{Rating}p %?"
         :time-prompt t)
        ("rm" "Movie" entry (file+olp+datetree "journal.org")
         "* %^{Title} :movie:\n%^{Rating}p%?"
         :time-prompt t)
        ("d" "Protocol" entry (file+headline org-browser-capture-file "Snippet")
         "** %?[[%:link][%:description]]\nCaptured On: %U\n#+BEGIN_QUOTE\n%i\n#+END_QUOTE\n"
         ;;  :immediate-finish t
         )
        ("L" "Protocol Link" entry (file+headline org-browser-capture-file "Link")
         "** %?[[%:link][%:description]] \nCaptured On: %U"
         ;; :immediate-finish t
         )))

(defun dfs/org-setup ()
  (require 'org-id)
  (require 'org-expiry)
  (advice-add 'org-insert-todo-heading :after #'dfs/insert-created-timestamp)
  (advice-add 'org-insert-todo-heading :after #'dfs/insert-id)
  (set-org-dir)



  (setq org-roam-directory (if (eq system-type 'darwin)
                               "~/Docs/org-roam"
                             "~/org-roam"))

  (defun dfs/org-file-name (name)
    (if (stringp name)
        (concat org-directory "/" name)
      ""))

  (setq org-treat-insert-todo-heading-as-state-change t)

  (setq org-agenda-files (if (eq system-type 'darwin)
                             '("~/Docs/work_org" "~/Docs/org")
                           '("~/work_org" "~/org")))

  (setq org-todo-keywords dfs/org-keywords)

  (setq org-capture-templates
        (append
         dfs/org-capture-templates
         org-capture-templates
         dfs/org-protocol-capture-templates))

  (setq org-log-into-drawer t)
  (setq org-agenda-follow-mode t)


  (org-bullets-mode 1)
  (org-babel-do-load-languages 'org-babel-load-languages
                               '((emacs-lisp . t)
                                 (sqlite . t))))

(after! org
  (dfs/org-setup)
 (set-org-dir))

(set-org-dir)
(add-hook 'org-capture-mode-hook #'dfs/org-setup)
(add-hook 'org-agenda-mode-hook #'dfs/org-setup)
(add-hook 'org-mode-hook #'dfs/org-setup)

#+end_src

#+RESULTS:
***

** TODO ORG EXHIBIT/TERMS TRACKER
:PROPERTIES:
:CREATED:  <2022-07-16 Sat 16:37>
:END:
:LOGBOOK:
:END:

#+begin_src emacs-lisp :tangle yes
    (defun dfs/apply-concat (list-of-lists)
        (-reduce-from (lambda (acc v)
                        (append acc v))
                        '()
                        list-of-lists))

    (defun dfs/org-elements-of-type (tree type)
        (org-element-map tree type #'identity))

    (defun dfs/org-get-table-by-name (name)
        (->> (dfs/org-elements-of-type (org-element-parse-buffer) 'table)
            (-filter (lambda (table) (equal name (org-element-property :name table))))
            car))

    (defun dfs/vec->list (vec)
        (append vec '()))

    (defun dfs/row-coords->fields (row-coord)
        "must be in the table"
        (-map (lambda (coord)
                (let ((r (elt coord 0))
                    (c (elt coord 1)))
                (org-table-get r c))) row-coord))

    (defun dfs/org-table-fields ()
        (->> org-table-dlines
            dfs/vec->list
            (-filter #'identity)
            (-map-indexed (lambda (index el) (+ 1 index)))
            (-map (lambda (r)
                    (let ((c org-table-current-ncol)
                            (ret '()))
                        (while (< 0 c)
                        (setq ret (cons (list r c) ret))
                        (setq c (- c 1)))
                        ret)))
            (-map #'dfs/row-coords->fields)))

    (defun dfs/org-table-by-name->values (name)
        (save-excursion
        (let* ((tbl (dfs/org-get-table-by-name name))
                (start (org-element-property :begin tbl)))
            (goto-char (+ 1 start))
            (org-table-analyze)
            (dfs/org-table-fields))))
#+end_src

#+RESULTS:
: dfs/org-table-by-name->values

